Autodesk.Revit.DB.WallSweepOrientation
Represents the orientation of horizonally placed sweep's profile relative to the wall side face.
Since:
2021

Autodesk.Revit.DB.WallSweepOrientation.Perpendicular
Profile is perpendicular to the wall side face

Autodesk.Revit.DB.WallSweepOrientation.Horizontal
Profile is oriented horizontally regardless of wall slant angle